----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           1,728
       BatchNorm2d-2         [-1, 64, 112, 112]             128
             PReLU-3         [-1, 64, 112, 112]              64
         MaxPool2d-4           [-1, 64, 56, 56]               0
       BatchNorm2d-5         [-1, 64, 112, 112]             128
            Conv2d-6         [-1, 64, 112, 112]          36,864
             PReLU-7         [-1, 64, 112, 112]              64
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
    bottleneck_IR-10           [-1, 64, 56, 56]               0
        MaxPool2d-11           [-1, 64, 56, 56]               0
      BatchNorm2d-12           [-1, 64, 56, 56]             128
           Conv2d-13           [-1, 64, 56, 56]          36,864
            PReLU-14           [-1, 64, 56, 56]              64
           Conv2d-15           [-1, 64, 56, 56]          36,864
      BatchNorm2d-16           [-1, 64, 56, 56]             128
    bottleneck_IR-17           [-1, 64, 56, 56]               0
        MaxPool2d-18           [-1, 64, 56, 56]               0
      BatchNorm2d-19           [-1, 64, 56, 56]             128
           Conv2d-20           [-1, 64, 56, 56]          36,864
            PReLU-21           [-1, 64, 56, 56]              64
           Conv2d-22           [-1, 64, 56, 56]          36,864
      BatchNorm2d-23           [-1, 64, 56, 56]             128
    bottleneck_IR-24           [-1, 64, 56, 56]               0
           Conv2d-25          [-1, 128, 28, 28]           8,192
      BatchNorm2d-26          [-1, 128, 28, 28]             256
      BatchNorm2d-27           [-1, 64, 56, 56]             128
           Conv2d-28          [-1, 128, 56, 56]          73,728
            PReLU-29          [-1, 128, 56, 56]             128
           Conv2d-30          [-1, 128, 28, 28]         147,456
      BatchNorm2d-31          [-1, 128, 28, 28]             256
    bottleneck_IR-32          [-1, 128, 28, 28]               0
        MaxPool2d-33          [-1, 128, 28, 28]               0
      BatchNorm2d-34          [-1, 128, 28, 28]             256
           Conv2d-35          [-1, 128, 28, 28]         147,456
            PReLU-36          [-1, 128, 28, 28]             128
           Conv2d-37          [-1, 128, 28, 28]         147,456
      BatchNorm2d-38          [-1, 128, 28, 28]             256
    bottleneck_IR-39          [-1, 128, 28, 28]               0
        MaxPool2d-40          [-1, 128, 28, 28]               0
      BatchNorm2d-41          [-1, 128, 28, 28]             256
           Conv2d-42          [-1, 128, 28, 28]         147,456
            PReLU-43          [-1, 128, 28, 28]             128
           Conv2d-44          [-1, 128, 28, 28]         147,456
      BatchNorm2d-45          [-1, 128, 28, 28]             256
    bottleneck_IR-46          [-1, 128, 28, 28]               0
        MaxPool2d-47          [-1, 128, 28, 28]               0
      BatchNorm2d-48          [-1, 128, 28, 28]             256
           Conv2d-49          [-1, 128, 28, 28]         147,456
            PReLU-50          [-1, 128, 28, 28]             128
           Conv2d-51          [-1, 128, 28, 28]         147,456
      BatchNorm2d-52          [-1, 128, 28, 28]             256
    bottleneck_IR-53          [-1, 128, 28, 28]               0
           Conv2d-54          [-1, 256, 14, 14]          32,768
      BatchNorm2d-55          [-1, 256, 14, 14]             512
      BatchNorm2d-56          [-1, 128, 28, 28]             256
           Conv2d-57          [-1, 256, 28, 28]         294,912
            PReLU-58          [-1, 256, 28, 28]             256
           Conv2d-59          [-1, 256, 14, 14]         589,824
      BatchNorm2d-60          [-1, 256, 14, 14]             512
    bottleneck_IR-61          [-1, 256, 14, 14]               0
        MaxPool2d-62          [-1, 256, 14, 14]               0
      BatchNorm2d-63          [-1, 256, 14, 14]             512
           Conv2d-64          [-1, 256, 14, 14]         589,824
            PReLU-65          [-1, 256, 14, 14]             256
           Conv2d-66          [-1, 256, 14, 14]         589,824
      BatchNorm2d-67          [-1, 256, 14, 14]             512
    bottleneck_IR-68          [-1, 256, 14, 14]               0
        MaxPool2d-69          [-1, 256, 14, 14]               0
      BatchNorm2d-70          [-1, 256, 14, 14]             512
           Conv2d-71          [-1, 256, 14, 14]         589,824
            PReLU-72          [-1, 256, 14, 14]             256
           Conv2d-73          [-1, 256, 14, 14]         589,824
      BatchNorm2d-74          [-1, 256, 14, 14]             512
    bottleneck_IR-75          [-1, 256, 14, 14]               0
        MaxPool2d-76          [-1, 256, 14, 14]               0
      BatchNorm2d-77          [-1, 256, 14, 14]             512
           Conv2d-78          [-1, 256, 14, 14]         589,824
            PReLU-79          [-1, 256, 14, 14]             256
           Conv2d-80          [-1, 256, 14, 14]         589,824
      BatchNorm2d-81          [-1, 256, 14, 14]             512
    bottleneck_IR-82          [-1, 256, 14, 14]               0
        MaxPool2d-83          [-1, 256, 14, 14]               0
      BatchNorm2d-84          [-1, 256, 14, 14]             512
           Conv2d-85          [-1, 256, 14, 14]         589,824
            PReLU-86          [-1, 256, 14, 14]             256
           Conv2d-87          [-1, 256, 14, 14]         589,824
      BatchNorm2d-88          [-1, 256, 14, 14]             512
    bottleneck_IR-89          [-1, 256, 14, 14]               0
        MaxPool2d-90          [-1, 256, 14, 14]               0
      BatchNorm2d-91          [-1, 256, 14, 14]             512
           Conv2d-92          [-1, 256, 14, 14]         589,824
            PReLU-93          [-1, 256, 14, 14]             256
           Conv2d-94          [-1, 256, 14, 14]         589,824
      BatchNorm2d-95          [-1, 256, 14, 14]             512
    bottleneck_IR-96          [-1, 256, 14, 14]               0
        MaxPool2d-97          [-1, 256, 14, 14]               0
      BatchNorm2d-98          [-1, 256, 14, 14]             512
           Conv2d-99          [-1, 256, 14, 14]         589,824
           PReLU-100          [-1, 256, 14, 14]             256
          Conv2d-101          [-1, 256, 14, 14]         589,824
     BatchNorm2d-102          [-1, 256, 14, 14]             512
   bottleneck_IR-103          [-1, 256, 14, 14]               0
       MaxPool2d-104          [-1, 256, 14, 14]               0
     BatchNorm2d-105          [-1, 256, 14, 14]             512
          Conv2d-106          [-1, 256, 14, 14]         589,824
           PReLU-107          [-1, 256, 14, 14]             256
          Conv2d-108          [-1, 256, 14, 14]         589,824
     BatchNorm2d-109          [-1, 256, 14, 14]             512
   bottleneck_IR-110          [-1, 256, 14, 14]               0
       MaxPool2d-111          [-1, 256, 14, 14]               0
     BatchNorm2d-112          [-1, 256, 14, 14]             512
          Conv2d-113          [-1, 256, 14, 14]         589,824
           PReLU-114          [-1, 256, 14, 14]             256
          Conv2d-115          [-1, 256, 14, 14]         589,824
     BatchNorm2d-116          [-1, 256, 14, 14]             512
   bottleneck_IR-117          [-1, 256, 14, 14]               0
       MaxPool2d-118          [-1, 256, 14, 14]               0
     BatchNorm2d-119          [-1, 256, 14, 14]             512
          Conv2d-120          [-1, 256, 14, 14]         589,824
           PReLU-121          [-1, 256, 14, 14]             256
          Conv2d-122          [-1, 256, 14, 14]         589,824
     BatchNorm2d-123          [-1, 256, 14, 14]             512
   bottleneck_IR-124          [-1, 256, 14, 14]               0
       MaxPool2d-125          [-1, 256, 14, 14]               0
     BatchNorm2d-126          [-1, 256, 14, 14]             512
          Conv2d-127          [-1, 256, 14, 14]         589,824
           PReLU-128          [-1, 256, 14, 14]             256
          Conv2d-129          [-1, 256, 14, 14]         589,824
     BatchNorm2d-130          [-1, 256, 14, 14]             512
   bottleneck_IR-131          [-1, 256, 14, 14]               0
       MaxPool2d-132          [-1, 256, 14, 14]               0
     BatchNorm2d-133          [-1, 256, 14, 14]             512
          Conv2d-134          [-1, 256, 14, 14]         589,824
           PReLU-135          [-1, 256, 14, 14]             256
          Conv2d-136          [-1, 256, 14, 14]         589,824
     BatchNorm2d-137          [-1, 256, 14, 14]             512
   bottleneck_IR-138          [-1, 256, 14, 14]               0
       MaxPool2d-139          [-1, 256, 14, 14]               0
     BatchNorm2d-140          [-1, 256, 14, 14]             512
          Conv2d-141          [-1, 256, 14, 14]         589,824
           PReLU-142          [-1, 256, 14, 14]             256
          Conv2d-143          [-1, 256, 14, 14]         589,824
     BatchNorm2d-144          [-1, 256, 14, 14]             512
   bottleneck_IR-145          [-1, 256, 14, 14]               0
       MaxPool2d-146          [-1, 256, 14, 14]               0
     BatchNorm2d-147          [-1, 256, 14, 14]             512
          Conv2d-148          [-1, 256, 14, 14]         589,824
           PReLU-149          [-1, 256, 14, 14]             256
          Conv2d-150          [-1, 256, 14, 14]         589,824
     BatchNorm2d-151          [-1, 256, 14, 14]             512
   bottleneck_IR-152          [-1, 256, 14, 14]               0
          Conv2d-153            [-1, 512, 7, 7]         131,072
     BatchNorm2d-154            [-1, 512, 7, 7]           1,024
     BatchNorm2d-155          [-1, 256, 14, 14]             512
          Conv2d-156          [-1, 512, 14, 14]       1,179,648
           PReLU-157          [-1, 512, 14, 14]             512
          Conv2d-158            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-159            [-1, 512, 7, 7]           1,024
   bottleneck_IR-160            [-1, 512, 7, 7]               0
       MaxPool2d-161            [-1, 512, 7, 7]               0
     BatchNorm2d-162            [-1, 512, 7, 7]           1,024
          Conv2d-163            [-1, 512, 7, 7]       2,359,296
           PReLU-164            [-1, 512, 7, 7]             512
          Conv2d-165            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-166            [-1, 512, 7, 7]           1,024
   bottleneck_IR-167            [-1, 512, 7, 7]               0
       MaxPool2d-168            [-1, 512, 7, 7]               0
     BatchNorm2d-169            [-1, 512, 7, 7]           1,024
          Conv2d-170            [-1, 512, 7, 7]       2,359,296
           PReLU-171            [-1, 512, 7, 7]             512
          Conv2d-172            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-173            [-1, 512, 7, 7]           1,024
   bottleneck_IR-174            [-1, 512, 7, 7]               0
         Flatten-175                [-1, 25088]               0
           PReLU-176                [-1, 25088]          25,088
         Dropout-177                [-1, 25088]               0
          Linear-178                    [-1, 1]          25,089
================================================================
Total params: 30,777,537
Trainable params: 30,777,537
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.14
Forward/backward pass size (MB): 138.58
Params size (MB): 117.41
Estimated Total Size (MB): 256.13
----------------------------------------------------------------
